name: Detect Credential Dumping through LSASS access
source: https://github.com/splunk/security_content/blob/develop/detections/endpoint/access_lsass_memory_for_dump_creation.yml
id: 2c365e57-4414-4540-8dc0-73ab10729996
version: 3
date: '2019-12-03'
author: Patrick Bareiss, Splunk
type: TTP
datamodel: []
description: This search looks for reading lsass memory consistent with credential
  dumping.
search: '`sysmon` EventCode=10 TargetImage=*lsass.exe (GrantedAccess=0x1010 OR GrantedAccess=0x1410 OR GrantedAccess=0x1fffff OR GrantedAccess=0x143a OR
    GrantedAccess=0x40) 
| stats count min(_time) as firstTime max(_time) as lastTime by Computer, SourceImage,
    SourceProcessId, TargetImage, TargetProcessId, EventCode, GrantedAccess 
| rename
    Computer as dest 
| `security_content_ctime(firstTime)` 
| `security_content_ctime(lastTime)` 
| search NOT SourceImage IN ("C:\\Windows\\system32\\csrss.exe", "C:\\Windows\\system32\\wininit.exe")'
how_to_implement: This search needs Sysmon Logs and a sysmon configuration, which
  includes EventCode 10 with lsass.exe. This search uses an input macro named `sysmon`.
  We strongly recommend that you specify your environment-specific configurations
  (index, source, sourcetype, etc.) for Windows Sysmon logs. Replace the macro definition
  with configurations for your Splunk environment. The search also uses a post-filter
  macro designed to filter out known false positives.
known_false_positives: The activity may be legitimate. Other tools can access lsass
  for legitimate reasons, and it's possible this event could be generated in those
  cases. In these cases, false positives should be fairly obvious and you may need
  to tweak the search to eliminate noise.
references: []
tags:
  analytic_story:
  - Credential Dumping
  - Detect Zerologon Attack
  asset_type: Windows
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Credential Access
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1003.001/atomic_red_team/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Actions on Objectives
  message: The $source_image$ has attempted access to read $TargetImage$ was identified
    on endpoint $Computer$, this is indicative of credential dumping and should be
    investigated.
  mitre_attack_id:
  - T1003.001
  - T1003
  nist:
  - PR.IP
  - PR.AC
  - DE.CM
  observable:
  - name: source_image
    type: Other
    role:
    - Victim
  - name: Computer
    type: Hostname
    role:
    - Victim
  - name: TargetImage
    type: Other
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - TargetImage
  - GrantedAccess
  - Computer
  - SourceImage
  - SourceProcessId
  - TargetImage
  - TargetProcessId
  risk_score: 80
  security_domain: endpoint